{
  "_name_or_path": "microsoft/layoutlmv3-base",
  "architectures": [
    "LayoutLMv3ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "coordinate_size": 128,
  "eos_token_id": 2,
  "has_relative_attention_bias": true,
  "has_spatial_attention_bias": true,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-fatura_numarasi",
    "2": "I-fatura_numarasi",
    "3": "B-fatura_tarihi",
    "4": "I-fatura_tarihi",
    "5": "B-fatura_tipi",
    "6": "I-fatura_tipi",
    "7": "B-ettn",
    "8": "I-ettn",
    "9": "B-son_odeme_tarihi",
    "10": "I-son_odeme_tarihi",
    "11": "B-satici_firma_unvani",
    "12": "I-satici_firma_unvani",
    "13": "B-satici_adres",
    "14": "I-satici_adres",
    "15": "B-satici_telefon",
    "16": "I-satici_telefon",
    "17": "B-satici_email",
    "18": "I-satici_email",
    "19": "B-satici_vergi_dairesi",
    "20": "I-satici_vergi_dairesi",
    "21": "B-satici_vergi_numarasi",
    "22": "I-satici_vergi_numarasi",
    "23": "B-satici_web_sitesi",
    "24": "I-satici_web_sitesi",
    "25": "B-satici_ticaret_sicil",
    "26": "I-satici_ticaret_sicil",
    "27": "B-satici_mersis_no",
    "28": "I-satici_mersis_no",
    "29": "B-alici_firma_unvani",
    "30": "I-alici_firma_unvani",
    "31": "B-alici_adres",
    "32": "I-alici_adres",
    "33": "B-alici_telefon",
    "34": "I-alici_telefon",
    "35": "B-alici_email",
    "36": "I-alici_email",
    "37": "B-alici_tckn",
    "38": "I-alici_tckn",
    "39": "B-alici_musteri_no",
    "40": "I-alici_musteri_no",
    "41": "B-urun_aciklama",
    "42": "I-urun_aciklama",
    "43": "B-urun_miktar",
    "44": "I-urun_miktar",
    "45": "B-birim_fiyat",
    "46": "I-birim_fiyat",
    "47": "B-urun_tutar",
    "48": "I-urun_tutar",
    "49": "B-kdv_orani",
    "50": "I-kdv_orani",
    "51": "B-mal_hizmet_toplam",
    "52": "I-mal_hizmet_toplam",
    "53": "B-toplam_iskonto",
    "54": "I-toplam_iskonto",
    "55": "B-vergi_haric_tutar",
    "56": "I-vergi_haric_tutar",
    "57": "B-hesaplanan_kdv",
    "58": "I-hesaplanan_kdv",
    "59": "B-vergiler_dahil_toplam",
    "60": "I-vergiler_dahil_toplam",
    "61": "B-genel_toplam",
    "62": "I-genel_toplam",
    "63": "B-odeme_sekli",
    "64": "I-odeme_sekli",
    "65": "B-banka_bilgileri",
    "66": "I-banka_bilgileri",
    "67": "B-kargo_bilgisi",
    "68": "I-kargo_bilgisi",
    "69": "B-siparis_no",
    "70": "I-siparis_no"
  },
  "initializer_range": 0.02,
  "input_size": 224,
  "intermediate_size": 3072,
  "label2id": {
    "B-alici_adres": 31,
    "B-alici_email": 35,
    "B-alici_firma_unvani": 29,
    "B-alici_musteri_no": 39,
    "B-alici_tckn": 37,
    "B-alici_telefon": 33,
    "B-banka_bilgileri": 65,
    "B-birim_fiyat": 45,
    "B-ettn": 7,
    "B-fatura_numarasi": 1,
    "B-fatura_tarihi": 3,
    "B-fatura_tipi": 5,
    "B-genel_toplam": 61,
    "B-hesaplanan_kdv": 57,
    "B-kargo_bilgisi": 67,
    "B-kdv_orani": 49,
    "B-mal_hizmet_toplam": 51,
    "B-odeme_sekli": 63,
    "B-satici_adres": 13,
    "B-satici_email": 17,
    "B-satici_firma_unvani": 11,
    "B-satici_mersis_no": 27,
    "B-satici_telefon": 15,
    "B-satici_ticaret_sicil": 25,
    "B-satici_vergi_dairesi": 19,
    "B-satici_vergi_numarasi": 21,
    "B-satici_web_sitesi": 23,
    "B-siparis_no": 69,
    "B-son_odeme_tarihi": 9,
    "B-toplam_iskonto": 53,
    "B-urun_aciklama": 41,
    "B-urun_miktar": 43,
    "B-urun_tutar": 47,
    "B-vergi_haric_tutar": 55,
    "B-vergiler_dahil_toplam": 59,
    "I-alici_adres": 32,
    "I-alici_email": 36,
    "I-alici_firma_unvani": 30,
    "I-alici_musteri_no": 40,
    "I-alici_tckn": 38,
    "I-alici_telefon": 34,
    "I-banka_bilgileri": 66,
    "I-birim_fiyat": 46,
    "I-ettn": 8,
    "I-fatura_numarasi": 2,
    "I-fatura_tarihi": 4,
    "I-fatura_tipi": 6,
    "I-genel_toplam": 62,
    "I-hesaplanan_kdv": 58,
    "I-kargo_bilgisi": 68,
    "I-kdv_orani": 50,
    "I-mal_hizmet_toplam": 52,
    "I-odeme_sekli": 64,
    "I-satici_adres": 14,
    "I-satici_email": 18,
    "I-satici_firma_unvani": 12,
    "I-satici_mersis_no": 28,
    "I-satici_telefon": 16,
    "I-satici_ticaret_sicil": 26,
    "I-satici_vergi_dairesi": 20,
    "I-satici_vergi_numarasi": 22,
    "I-satici_web_sitesi": 24,
    "I-siparis_no": 70,
    "I-son_odeme_tarihi": 10,
    "I-toplam_iskonto": 54,
    "I-urun_aciklama": 42,
    "I-urun_miktar": 44,
    "I-urun_tutar": 48,
    "I-vergi_haric_tutar": 56,
    "I-vergiler_dahil_toplam": 60,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 514,
  "max_rel_2d_pos": 256,
  "max_rel_pos": 128,
  "model_type": "layoutlmv3",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "patch_size": 16,
  "rel_2d_pos_bins": 64,
  "rel_pos_bins": 32,
  "second_input_size": 112,
  "shape_size": 128,
  "text_embed": true,
  "torch_dtype": "float32",
  "transformers_version": "4.30.2",
  "type_vocab_size": 1,
  "visual_embed": true,
  "vocab_size": 50265
}
